[
  {
    "path": "posts/2024-06-06-how-much-control-do-we-really-need/",
    "title": "How much control do we really need?",
    "description": "What are bad controls?",
    "author": [
      {
        "name": "Orkhan Sariyev",
        "url": {}
      }
    ],
    "date": "2024-06-06",
    "categories": [],
    "contents": "\r\nThree sources of association\r\nMany of us are control freaks. If you’ve decided to read this blog, you probably are one too. Applied researchers, especially those just starting out with observational data, are keen to control for variables they think relate to the outcome or exposure. To claim causality and avoid omitted variable bias, we’re often motivated to control for variables that feel very “close” to our variables of interest. But there’s a big problem here. You’ve heard it many times: correlation is not causation.\r\nFirst, let’s understand the three sources of association because these help us identify good and bad controls:\r\nConfounder or common cause means that exposure (X) and outcome (Y) share a common cause (Z). This is visualized in Figure 1. Z affects X and Y, and introduces a non-causal association (induce spurious associations) between X and Y. In this cases, we have learned that we must control for Z. Here, controlling or conditioning on Z means that we block the spurious association and identify the causal effect of X on Y. Thus, Z is a good (i.e., necessary) control here.\r\n\r\n\r\n\r\nFigure 1: Confounder\r\n\r\n\r\n\r\nCollider means that exposure (X) and outcome (Y) share a common effect (Z). This is visualized in Figure 2. X and Y, both affect Z. Unlike the previous scenario, X and Y having effect on Z does not introduce association. In this case, our results would be biased if we control for Z; we would induce a non-causal association. Thus, Z is a bad control here. Do not control for Z!!!\r\n\r\n\r\n\r\nFigure 2: Collider\r\n\r\n\r\n\r\nMediator means that exposure (X) affects outcome of interest (Y) through the mediator (Z). If we control for Z, we block the association. Figure 3 visualizes a chain. Controlling for Z on this causal pathway stops the flow of association and results in overcontrol bias. Thus, Z is again a bad control. Again, do not control for Z!!!\r\nCAVEAT!!! Here, I’m assuming that the interest lies in the total effect of X on Y. Conditioning on Z is relevant if the researcher is interested in the controlled direct effect (CDE), which we commonly encounter in mediation analyses.\r\n\r\n\r\n\r\nFigure 3: Mediator\r\n\r\n\r\n\r\nNeutral controls\r\nActually, not all controls must be good or bad. There are also neutral controls. Let’s start with a scenario where Z and X affect Y, but Z and X are not correlated. We assume no effect of X on Z or Z on X. In this case, Z is considered a neutral control. Controlling for Z does no harm, and likely to improve the precision of the effect estimate, because controlling for Z would reduce the variation of Y. This is visualized in Figure 4\r\n\r\n\r\n\r\nFigure 4: Neutral control: good for precision\r\n\r\n\r\n\r\nI believe it is also necessary to highlight one more scenario (among many more possible), where Z determines exposure (X) but not the outcome of interest (Y). This is visualized in Figure 5. Although we may still consider Z as a neutral control (since it does not introduce any bias), unlike the previous scenario in Figure 4, this does harm the precision of the effect estimate we are interested to find.\r\n\r\n\r\n\r\nFigure 5: Neutral control: bad for precision\r\n\r\n\r\n\r\nIt is important to mention that I have only covered the simplest scenarios and one can think of much more challenging scenarios, but for the sake of simplicity and basic understanding, I will leave it at this. I hope this is helpful.\r\n\r\n\r\n\r\n",
    "preview": "posts/2024-06-06-how-much-control-do-we-really-need/effect.png",
    "last_modified": "2024-06-06T22:38:14+02:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-08-10-building-distil/",
    "title": "Building a {distil} website",
    "description": "How did I build this website?",
    "author": [
      {
        "name": "Orkhan Sariyev",
        "url": {}
      }
    ],
    "date": "2023-08-10",
    "categories": [],
    "contents": "\r\nIn my inaugural blog post, I am excited to share a comprehensive list of resources that proved instrumental in the construction of this website. For those who may be newcomers to the realms of both R markdown and distil, I trust that this post will serve as a valuable aid. While I myself am relatively new to these tools, I have grown more at ease with markdown through various projects. A fortunate advantage is the wealth of individuals who have generously shared their insights and are enthusiastic about guiding fellow learners like us.\r\nMy initiation into the world of distil occurred through a mention on Twitter. How do you usually respond to news of something new? Researching on Google or exploring YouTube videos perhaps? I embarked on a similar journey! Eventually, I stumbled upon Lisa Lendway’s website which, by the way, she constructed using distil. Furthermore, there is also a Youtube video. This was already good enough to set up my webpage over night!\r\nMy subsequent step involved exploring various example websites as provided by the distil documentation. . I am sure by googling a bit more, one can find many other example websites built with distil that provide code publicly. One of these sources is definitely Open Source Football.\r\nI soon realized I had forgotten to add my email to the website. I wanted to have it on the main page as a footer, and realized Open Source Football had a footer too! Checking their GitHub, I realized they had a _footer.html file which must be what I need. Again, with some googling I found out about rstudio4edu which has a lot of information on markdown, distill, and bookdown. Next step was to make the footer look nice! I searched for HTML email tag and envelope icon, and added them into the html (actually a text) file; and boom! Very easy!\r\nI am still constructing my website, thus this blog will be updated constantly.\r\n\r\n\r\n\r\n",
    "preview": "posts/2023-08-10-building-distil/preview_post1.jpg",
    "last_modified": "2024-04-23T12:35:31+02:00",
    "input_file": {}
  }
]
